/////////////////////////////////////////////////
// Viewizard Game Engine
/////////////////////////////////////////////////
// File: vfs_var..cpp
/////////////////////////////////////////////////
// Copyright (c) 2001-2006, Michael Kurinnoy
// All Rights Reserved.
/////////////////////////////////////////////////
// Ver : 2.0
/////////////////////////////////////////////////


//------------------------------------------------------------------------------------
// include и lib...
//------------------------------------------------------------------------------------
#include "vfs_var.h"


//------------------------------------------------------------------------------------
// переменные
//------------------------------------------------------------------------------------
char *VFSFileName = 0;		// Имя файла VFS
FILE *VFSFile = 0;			// Указатель на файл виртуальной системы
byte *dstVFS = 0;			// данные для архивир/разарх
byte *srcVFS = 0;			// данные для архивир/разарх
int  dsizeVFS = 0;			// данные для архивир/разарх
int  ssizeVFS = 0;			// данные для архивир/разарх
int  DataStartOffsetVFS = 0;// смещение данных в структуре VFS (без 8 байт смещ табл)
int  HeaderOffsetVFS = 0;	// смещение таблицы данных в структуре VFS
int  HeaderLengthVFS = 0;	// Длина таблицы данный структуры VFS
int  NumberOfFilesVFS = 0;	// количество файлов в VFS
bool VFSFileOpen = false;	// Датчик открытой VFS
bool VFSFileWritable = false;	// Можем писать в VFS файл
eVFS_Entry *VFSdirArray = 0;// Массив записей VFS
bool SetUpperVFS = false;	// установка букв в названии файла в верхний регистр (проверка без учета регистра)
char *ArhKeyVFS = 0;		// Ключ-упаковки
eFILE *StartFileVFS = 0;	// Указатель на первый файл в списке...
eFILE *EndFileVFS = 0;		// Указатель на последний файл в списке...

int VFSversion = 2;


